# Equality Operator (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinitionId..::..Equality Operator
FailureDefinitionId Class See Also
---
Compares two FailureDefinitionId instances.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator ==(
	FailureDefinitionId first,
	FailureDefinitionId second
)
```

Visual Basic
---
```text
Public Shared Operator = ( _
	first As FailureDefinitionId, _
	second As FailureDefinitionId _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator ==(
	FailureDefinitionId^ first,
	FailureDefinitionId^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..FailureDefinitionIdThe first FailureDefinitionId.
second
    Type: Autodesk.Revit.DB..::..FailureDefinitionIdThe second FailureDefinitionId.
# ### Return Value
True if the inputs are identical, false if they are different.
# See Also
FailureDefinitionId Class
Autodesk.Revit.DB Namespace